Revit 2027 API
BuiltInFailures.DPartFailures.RemovingInvalidDPartParents Property
 Can't make Parts out of these Elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemovingInvalidDPartParents { get; }
Public Shared ReadOnly Property RemovingInvalidDPartParents As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemovingInvalidDPartParents {
	FailureDefinitionId^ get ();
}
static member RemovingInvalidDPartParents : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace